# CurveDeterminesOrientation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CurveDeterminesOrientation Property
ParameterTypeId Class See Also
---
"Determines Orientation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CurveDeterminesOrientation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurveDeterminesOrientation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CurveDeterminesOrientation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace